app/controllers/books_controller.rb

  def populate
    Book.delete_all
    Author.delete_all
    Publisher.delete_all
    (nc = Author.new(:name => 'Noam Chomsky')).save
    (cb = Author.new(:name => 'Cedric Boeckx')).save
    (nr = Author.new(:name => 'Norvin Richards')).save
    (mitp = Publisher.new(:name => 'MIT Press')).save
    (oup = Publisher.new(:name => 'Oxford University Press')).save
    (jb = Publisher.new(:name => 'John Benjamins')).save
    nc.reload
    cb.reload
    nr.reload
    mitp.reload
    oup.reload
    Book.new(:title => 'Aspects of the Theory of Syntax', :author => nc, :publisher => mitp).save
---
DELETE FROM "books" WHERE 1=1
DELETE FROM "authors" WHERE 1=1
DELETE FROM "publishers" WHERE 1=1
INSERT INTO "authors" ("name", "updated_at", "created_at") VALUES('Noam Chomsky', '2009-06-12 07:33:17', '2009-06-12 07:33:17')
INSERT INTO "publishers" ("name", "updated_at", "created_at") VALUES('MIT Press', '2009-06-12 07:34:11', '2009-06-12 07:34:11')
INSERT INTO "books" ("updated_at", "title", "author_id", "publisher_id", "created_at") VALUES('2009-06-12 07:34:59', 'Aspects of the Theory of Syntax', 5, 4, '2009-06-12 07:34:59')